In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('/Users/tuhinalambijoy/Downloads/Current_Employee_Names__Salaries__and_Position_Titles.csv')

In [4]:
df

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN

In [5]:
df.describe().round(2)

       Typical Hours
count        7883.00
mean           34.70
std             9.15
min            10.00
25%            20.00
50%            40.00
75%            40.00
max            40.00

In [6]:
print("Max value in typical hours :",df['Typical Hours'].max())

Max value in typical hours : 40.0

In [7]:
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

In [8]:
df['Salary or Hourly'].value_counts()

Salary or Hourly
Salary    24775
Hourly     7883
Name: count, dtype: int64

In [9]:
df.groupby('Salary or Hourly').count()

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Annual Salary,Hourly Rate
Salary or Hourly,,,,,,,
Hourly,7883,7883,7883,7883,7883,0,7883
Salary,24775,24775,24775,24775,0,24775,0

In [10]:
df.groupby('Salary or Hourly')[['Salary or Hourly']].count()

                  Salary or Hourly
Salary or Hourly
Hourly                        7883
Salary                       24775

In [11]:
df['Department'].value_counts().head(1)

Department
POLICE    12973
Name: count, dtype: int64

In [12]:
df.groupby(['Department']).value_counts(['Salary or Hourly'])

Department             Salary or Hourly
ADMIN HEARNG           Salary                 38
ANIMAL CONTRL          Salary                 57
                       Hourly                 16
AVIATION               Hourly               1056
                       Salary                556
BOARD OF ELECTION      Salary                112
BOARD OF ETHICS        Salary                  8
BUDGET & MGMT          Salary                 43
                       Hourly                  1
BUILDINGS              Salary                266
BUSINESS AFFAIRS       Salary                160
                       Hourly                  8
CITY CLERK             Salary                 82
                       Hourly                  3
CITY COUNCIL           Salary                348
                       Hourly                 52
COMMUNITY DEVELOPMENT  Salary                210
                       Hourly                  4
COPA                   Salary                 17
CULTURAL AFFAIRS       Salary                 66
                       Hourly                 10
DISABILITIES           Salary                 29
DoIT                   Salary                101
FAMILY & SUPPORT       Salary                321
                       Hourly                300
FINANCE                Salary                532
                       Hourly                 43
FIRE                   Salary               4798
                       Hourly                  2
GENERAL SERVICES       Hourly                767
                       Salary                205
HEALTH                 Salary                512
                       Hourly                  4
HUMAN RELATIONS        Salary                 17
HUMAN RESOURCES        Salary                 67
                       Hourly                  1
INSPECTOR GEN          Salary                 63
IPRA                   Salary                 56
LAW                    Salary                361
                       Hourly                 44
LICENSE APPL COMM      Salary                  1
MAYOR'S OFFICE         Salary                 78
                       Hourly                  7
OEMC                   Hourly               1212
                       Salary                832
POLICE                 Salary              12941
                       Hourly                 32
POLICE BOARD           Salary                  2
PROCUREMENT            Salary                 82
                       Hourly                  4
PUBLIC LIBRARY         Salary                708
                       Hourly                224
STREETS & SAN          Hourly               1873
                       Salary                321
TRANSPORTN             Hourly                707
                       Salary                396
TREASURER              Salary                 23
                       Hourly                  1
WATER MGMNT            Hourly               1512
                       Salary                366
Name: count, dtype: int64

In [13]:
df[df["Department"].isin(["Police"])]

Empty DataFrame
Columns: [Name, Job Titles, Department, Full or Part-Time, Salary or Hourly, Typical Hours, Annual Salary, Hourly Rate]
Index: []

In [14]:
df[df['Department']=='POLICE']['Salary or Hourly'].value_counts()

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

In [15]:
df['Salary']=df['Annual Salary'].str.replace('$','').astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
 8   Salary             24775 non-null  float64
dtypes: float64(2), object(7)
memory usage: 2.2+ MB

In [16]:
df['Salary'].max()

np.float64(300000.0)

In [17]:
df[df['Salary']==df['Salary'].max()][["Name","Salary"]]

                  Name    Salary
8310  EVANS,  GINGER S  300000.0

In [18]:
df['Salary'].idxmin()

15387

In [19]:
df.to_csv('/Users/tuhinalambijoy/Downloads/Chicago.csv')

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
 8   Salary             24775 non-null  float64
dtypes: float64(2), object(7)
memory usage: 2.2+ MB

Find who has minimum salary

In [29]:
df[df['Salary']==df['Salary'].min()][["Name","Salary"]]

                 Name  Salary
15387  KOCH,  STEVEN     0.96

Find who has maximum salary

In [30]:
df[df['Salary']==df["Salary"].max()][["Name","Salary"]]

                  Name    Salary
8310  EVANS,  GINGER S  300000.0

Find who has designation officer in their title

In [31]:
df[df['Job Titles'].str.contains('Officer',case=False)]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0
12,"FREELON, CHERYL N",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN,96060.0
15,"HARRIS, DANIEL J",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0
27,"MOORE, TED D",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0
35,"ROBINSON, HAROLD",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0
...,...,...,...,...,...,...,...,...,...
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0

In [33]:
df.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
Salary                7883
dtype: int64

In [34]:
df.isnull().any(axis=1).sum()

np.int64(32658)

Filling the null values for the salary colum using mean

In [44]:
df['Salary']=df['Salary'].fillna(df['Salary'].mean())
df[['Salary']].mean()

Salary    87512.780241
dtype: float64

In [36]:
df['Salary'].isnull().sum()

np.int64(0)

In [40]:
df.sort_values(by="Salary",ascending=True)['Salary']

15387         0.96
3051      10008.00
28860     12840.00
6573      13002.00
28756     15000.00
           ...
9062     197736.00
26028    202728.00
8079     216210.00
13999    260004.00
8310     300000.00
Name: Salary, Length: 32658, dtype: float64

fill the null valus by the mode

In [41]:
df['Salary']=df['Salary'].fillna(df['Salary'].mode())
df[['Salary']]

         Salary
0      107790.0
1      104628.0
2      114324.0
3       76932.0
4      111474.0
...         ...
32653   90024.0
32654   48078.0
32655   87006.0
32656   93354.0
32657  115932.0

[32658 rows x 1 columns]

In [45]:
df[["Salary"]].mean()

Salary    87512.780241
dtype: float64

find who has department police and salary hourly

In [46]:
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0